vanvught/GD32F450VI-DMX512-PIXEL/lib-ws28xx/src/gd32/gpio/ws28xxmulti.cpp
	DEBUG_EXIT
}

void WS28xxMulti::Setup(uint32_t nFrequency) {
	DEBUG_ENTRY

	/**
	 * BEGIN GPIO
	 */

	rcu_periph_clock_enable(TIMER2CH0_RCU_GPIOx);
#if !defined (GD32F4XX)
	 rcu_periph_clock_enable(RCU_AF);
	 gpio_init(TIMER2CH0_GPIOx, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, TIMER2CH0_GPIO_PINx);
#else
	gpio_mode_set(TIMER2CH0_GPIOx, GPIO_MODE_AF, GPIO_PUPD_NONE, TIMER2CH0_GPIO_PINx);
	gpio_output_options_set(TIMER2CH0_GPIOx, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, TIMER2CH0_GPIO_PINx);
	gpio_af_set(TIMER2CH0_GPIOx, GPIO_AF_2, TIMER2CH0_GPIO_PINx);
#endif

	/**
	 * END GPIO
	 */

	/**
	 * BEGIN Timer's
	 *
	 * Timer 2 is Master -> TIMER2_TRGO
	 * Timer 3 is Slave -> ITI2
	 *
	 */

	/**
	 * Frequency = MASTER_TIMER_CLOCK  / x => x = MASTER_TIMER_CLOCK / Frequency
	 */

	auto nTicker = (MASTER_TIMER_CLOCK / nFrequency);

	DEBUG_PRINTF("nFrequency=%u, nTicker=%u", nFrequency, nTicker);

	if (nTicker < 12) {	// ((nTicker / 4) - 1) >= 2
		nTicker = 12;
	}

	/**
	 * Timer 2 Master
	 *
	 * Implementation note: There is no DMA Channel for Timer 2 Channel 1
	 */

    rcu_periph_clock_enable(RCU_TIMER2);
    timer_deinit(TIMER2);

    timer_parameter_struct timer_initpara;
    timer_initpara.prescaler         = 0;
    timer_initpara.alignedmode       = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection  = TIMER_COUNTER_UP;
    timer_initpara.period            = nTicker - 1;
    timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER2,&timer_initpara);

    timer_oc_parameter_struct timer_ocintpara;
    timer_ocintpara.ocpolarity  = TIMER_OC_POLARITY_LOW;
    timer_ocintpara.outputstate = TIMER_CCX_ENABLE;
    timer_ocintpara.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
    timer_ocintpara.outputnstate = TIMER_CCXN_DISABLE;
    timer_ocintpara.ocidlestate  = TIMER_OC_IDLE_STATE_HIGH;
    timer_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;

	timer_channel_output_config(TIMER2, TIMER_CH_0, &timer_ocintpara);
	assert(((nTicker / 2) - 1) < UINT16_MAX);
	timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_0, static_cast<uint16_t>((nTicker / 2) - 1));
	timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_PWM0);
	timer_channel_output_shadow_config(TIMER2, TIMER_CH_0, TIMER_OC_SHADOW_DISABLE);

	timer_channel_output_mode_config(TIMER2, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_2, 1);
	assert(((nTicker / 4) - 1) >= 2);
	assert(((nTicker / 4) - 1) < UINT16_MAX);
	timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_3, static_cast<uint16_t>((nTicker / 4) - 1));

	timer_master_slave_mode_config(TIMER2, TIMER_MASTER_SLAVE_MODE_DISABLE);
	timer_master_output_trigger_source_select(TIMER2, TIMER_TRI_OUT_SRC_CH0);

	// Timer 3 Slave

	rcu_periph_clock_enable(RCU_TIMER3);

	timer_deinit(TIMER3);

	timer_initpara.prescaler = 0;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;

	timer_init(TIMER3, &timer_initpara);

	timer_master_slave_mode_config(TIMER3, TIMER_MASTER_SLAVE_MODE_DISABLE);
	timer_slave_mode_select(TIMER3, TIMER_SLAVE_MODE_EXTERNAL0);
	timer_input_trigger_source_select(TIMER3, TIMER_SMCFG_TRGSEL_ITI2);

	timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	assert(m_nBufSize < UINT16_MAX);
	timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_0, static_cast<uint16_t>(m_nBufSize));

	timer_interrupt_enable(TIMER3, TIMER_INT_CH0);

	NVIC_SetPriority(TIMER3_IRQn, 0);
	NVIC_EnableIRQ(TIMER3_IRQn);

	/**
	 * END Timer's
	 */

	/**
	 * START DMA configuration
	 */

	DMA_PARAMETER_STRUCT dma_init_struct;
	rcu_periph_clock_enable(TIMER2_RCU_DMAx);

	// Timer 2 Channel 2
	dma_deinit(TIMER2_DMAx, TIMER2_CH2_DMA_CHx);
	dma_struct_para_init(&dma_init_struct);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
#if !defined (GD32F4XX)
	dma_init_struct.memory_addr = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
#else
	dma_init_struct.memory0_addr = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
#endif
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
#endif
	dma_init_struct.periph_addr = GPIOx + GPIOx_BC_OFFSET;;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_LOW;
	dma_init(TIMER2_DMAx, TIMER2_CH2_DMA_CHx, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(TIMER2_DMAx, TIMER2_CH2_DMA_CHx);
	dma_memory_to_memory_disable(TIMER2_DMAx, TIMER2_CH2_DMA_CHx);
#if defined (GD32F4XX)
	dma_channel_subperipheral_select(TIMER2_DMAx, TIMER2_CH2_DMA_CHx, TIMER2_CH2_DMA_SUBPERIx);
#endif

	// Timer 2 Channel 3
	dma_deinit(TIMER2_DMAx, TIMER2_CH3_DMA_CHx);
	dma_struct_para_init(&dma_init_struct);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
#if !defined (GD32F4XX)
	dma_init_struct.memory_addr = reinterpret_cast<uint32_t>(pixel::s_DmaBuffer);
#else
	dma_init_struct.memory0_addr = reinterpret_cast<uint32_t>(pixel::s_DmaBuffer);
#endif
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
#endif
	dma_init_struct.periph_addr = GPIOx + GPIOx_BOP_OFFSET;;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_LOW;
	dma_init(TIMER2_DMAx, TIMER2_CH3_DMA_CHx, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(TIMER2_DMAx, TIMER2_CH3_DMA_CHx);
	dma_memory_to_memory_disable(TIMER2_DMAx, TIMER2_CH3_DMA_CHx);
#if defined (GD32F4XX)
	dma_channel_subperipheral_select(TIMER2_DMAx, TIMER2_CH3_DMA_CHx, TIMER2_CH3_DMA_SUBPERIx);
#endif

	/**
	 * END DMA configuration
	 */

	/**
	 * BEGIN Buffer setup
	 */

