vanvught/GD32F450VI-DMX512-PIXEL/lib-ws28xx/src/gd32/gpio/ws28xxmulti.cpp
	DEBUG_EXIT
}

bool  WS28xxMulti::IsUpdating() {
	__DMB();
	return sv_isRunning;
}

#define BIT_SET(Addr, Bit) {																						\
	*(volatile uint32_t *) (BITBAND_SRAM_BASE + (((uint32_t)&Addr) - SRAM_BASE) * 32U + (Bit & 0xFF) * 4U) = 0x1;	\
}

#define BIT_CLEAR(Addr, Bit) {																						\
	*(volatile uint32_t *) (BITBAND_SRAM_BASE + (((uint32_t)&(Addr)) - SRAM_BASE) * 32U + (Bit & 0xFF) * 4U) = 0x0;	\
}

void WS28xxMulti::SetColourRTZ(const uint32_t nPortIndex, const uint32_t nPixelIndex, const uint8_t nColour1, const uint8_t nColour2, const uint8_t nColour3) {
	assert(nPortIndex < pixel::PORT_COUNT);

	uint32_t j = 0;
	const auto k = nPixelIndex * pixel::single::RGB;
	const auto nBit = nPortIndex + GPIO_PIN_OFFSET;
	auto *p = &pixel::s_pBuffer[k];

	for (uint8_t mask = 0x80; mask != 0; mask = static_cast<uint8_t>(mask >> 1)) {
		if (!(mask & nColour1)) {
			BIT_SET(p[j], nBit);
		} else {
			BIT_CLEAR(p[j], nBit);
		}
		if (!(mask & nColour2)) {
			BIT_SET(p[8 + j], nBit);
		} else {
			BIT_CLEAR(p[8 + j], nBit);
		}
		if (!(mask & nColour3)) {
			BIT_SET(p[16 + j], nBit);
		} else {
			BIT_CLEAR(p[16 + j], nBit);
		}

		j++;
	}
}

void WS28xxMulti::SetColourWS2801(const uint32_t nPortIndex, const uint32_t nPixelIndex, const uint8_t nColour1, const uint8_t nColour2, const uint8_t nColour3) {
	assert(nPortIndex < 16);
	assert(nPixelIndex < m_nBufSize / 8);		//FIXME 8

	uint32_t j = 0;
	const auto k = nPixelIndex * pixel::single::RGB;
	const auto nBit = nPortIndex + GPIO_PIN_OFFSET;
	auto *p = &pixel::s_DmaBuffer[k];

	for (uint8_t mask = 0x80; mask != 0; mask = static_cast<uint8_t>(mask >> 1)) {
		if (mask & nColour1) {
			BIT_SET(p[j], nBit);
		} else {
			BIT_CLEAR(p[j], nBit);
		}
		if (mask & nColour2) {
			BIT_SET(p[8 + j], nBit);
		} else {
			BIT_CLEAR(p[8 + j], nBit);
		}
		if (mask & nColour3) {
			BIT_SET(p[16 + j], nBit);
		} else {
			BIT_CLEAR(p[16 + j], nBit);
		}

		j++;
	}
}

void WS28xxMulti::SetPixel4Bytes(const uint32_t nPortIndex, const uint32_t nPixelIndex, const uint8_t nCtrl, const uint8_t nColour1, const uint8_t nColour2, const uint8_t nColour3) {
	assert(nPortIndex < 16);
	assert(nPixelIndex < m_nBufSize / 8);	//FIXME 8

	uint32_t j = 0;
	const auto k = nPixelIndex * pixel::single::RGBW;
	const auto nBit = nPortIndex + GPIO_PIN_OFFSET;
	auto *p = &pixel::s_DmaBuffer[k];

	for (uint8_t mask = 0x80; mask != 0; mask = static_cast<uint8_t>(mask >> 1)) {
		if (mask & nCtrl) {
			BIT_SET(p[j], nBit);
		} else {
			BIT_CLEAR(p[j], nBit);
		}

		if (mask & nColour1) {
			BIT_SET(p[8 + j], nBit);
		} else {
			BIT_CLEAR(p[8 + j], nBit);
		}

		if (mask & nColour2) {
			BIT_SET(p[16 + j], nBit);
		} else {
			BIT_CLEAR(p[16 + j], nBit);
		}

		if (mask & nColour3) {
			BIT_SET(p[24 + j], nBit);
		} else {
			BIT_CLEAR(p[24 + j], nBit);
		}

		j++;
	}
}

void WS28xxMulti::SetColourRTZ(const uint32_t nPortIndex, const uint32_t nPixelIndex, uint8_t nRed, uint8_t nGreen, uint8_t nBlue, uint8_t nWhite) {
	assert(nPortIndex < 16);
	assert(nPixelIndex < m_nBufSize / 8);	//FIXME 8

#if defined(CONFIG_PIXELDMX_ENABLE_GAMMATABLE)
	const auto pGammaTable = pixelConfiguration.GetGammaTable();

	nRed = pGammaTable[nRed];
	nGreen = pGammaTable[nGreen];
	nBlue = pGammaTable[nBlue];
	nWhite = pGammaTable[nWhite];
#endif

	const auto k = nPixelIndex * pixel::single::RGBW;
	const auto nBit = nPortIndex + GPIO_PIN_OFFSET;

	auto *p = &pixel::s_DmaBuffer[k];
	uint32_t j = 0;

	for (uint8_t mask = 0x80; mask != 0; mask = static_cast<uint8_t>(mask >> 1)) {
		// GRBW
		if (!(mask & nGreen)) {
			BIT_SET(p[j], nBit);
		} else {
			BIT_CLEAR(p[j], nBit);
		}

		if (!(mask & nRed)) {
			BIT_SET(p[8 + j], nBit);
		} else {
			BIT_CLEAR(p[8 + j], nBit);
		}

		if (!(mask & nBlue)) {
			BIT_SET(p[16 + j], nBit);
		} else {
			BIT_CLEAR(p[16 + j], nBit);
		}

		if (!(mask & nWhite)) {
			BIT_SET(p[24 + j], nBit);
		} else {
			BIT_CLEAR(p[24 + j], nBit);
		}

		j++;
	}
}
